app/Livewire/User/RequirementDetailModal.php

select * from `requirements` where `requirements`.`id` = 2 limit 1
---
    public function loadRequirement($requirementId)
    {
        $this->requirement = Requirement::with([
            'guides',
            'userSubmissions' => function ($query) {
                $query->with(['submissionFile', 'reviewer'])
                    ->latest();
            }
        ])->find($requirementId);