app/Livewire/Admin/RequirementCreateModal.php

    public function activeSemester()
    {
        return Semester::where('is_active', true)->first();
---
select * from `semesters` where `is_active` = 1 limit 1