app/Livewire/Admin/Management/SemesterManagement.php

    private function checkDateOverlap($startDate, $endDate, $excludeId = null)
    {
        $query = Semester::where(function($q) use ($startDate, $endDate) {
            $q->whereBetween('start_date', [$startDate, $endDate])
              ->orWhereBetween('end_date', [$startDate, $endDate])
              ->orWhere(function($q) use ($startDate, $endDate) {
                  $q->where('start_date', '<=', $startDate)
                    ->where('end_date', '>=', $endDate);
              });
        });

        if ($excludeId) {
            $query->where('id', '!=', $excludeId);
        }

        return $query->exists();
---
select * from `semesters` where `semesters`.`id` = 1 limit 1

    private function checkDuplicateSemester($semesterType, $academicYear, $excludeId = null)
    {
        $semesterName = ucfirst($semesterType) . ($semesterType == 'midyear' ? '' : ' Semester') . ' | ' . $academicYear;

        $query = Semester::where('name', $semesterName);

        if ($excludeId) {
            $query->where('id', '!=', $excludeId);
        }

        return $query->exists();
---
select * from `semesters` where `semesters`.`id` = 1 limit 1