app/Livewire/Admin/SubmittedRequirements/SubmittedRequirementsIndex.php

select * from `colleges` where `colleges`.`id` in (1)
select * from `departments` where `departments`.`id` in (1)
select * from `requirements` where `requirements`.`id` in (2)
select * from `users` where `users`.`id` in (1)
---
                    $groupName = $requirement->name;

                    // Get submissions for this requirement
                    $submissions = SubmittedRequirement::where('requirement_id', $requirement->id)
                        ->with(['user.college', 'user.department', 'media'])
                        ->get();