app/Livewire/Admin/FileManager/FileManagerIndex.php

    public function loadSemesterFiles($semesterId)
    {
        $this->selectedSemester = Semester::find($semesterId);
---
select * from `semesters` where `semesters`.`id` = '1' limit 1