app/Models/Requirement.php

select * from `colleges` where `name` = 'College of Criminal Justice' limit 1
select * from `users` where `college_id` = 3
---
    public function assignedTargets()
    {
        $college = College::where('name', $this->assigned_to)->first();
        if ($college) {
            return User::where('college_id', $college->id)->get();