app/Models/Semester.php

select * from `semesters` where `is_active` = 1 limit 1
---
    public static function getActiveSemester()
    {
        return self::where('is_active', true)->first();