app/Models/User.php

select * from `colleges` where `colleges`.`id` = 1 limit 1
select * from `departments` where `departments`.`id` = 1 limit 1
---
    public function requirements()
    {
        return \App\Models\Requirement::where(function ($query) {
            if ($this->college) {
                $query->orWhere('assigned_to', $this->college->name);
            }

            if ($this->department) {
                $query->orWhere('assigned_to', $this->department->name);
            }
        });