app/Http/Controllers/admin/SemesterController.php

    public function setActive($id)
    {
        Semester::query()->update(['is_active' => false]);
        $semester = Semester::findOrFail($id);
---
select * from `semesters` where `semesters`.`id` = 1 limit 1

    public function downloadZippedSemester(Semester $semester)
    {
        $zipFileName = preg_replace('/[^A-Za-z0-9_\- ]/', '_', $semester->name) . '_requirements.zip';
        $zipFilePath = storage_path('app/temp/semesters/' . $zipFileName);

        // Ensure directory exists
        $directory = storage_path('app/temp/semesters');
        if (!file_exists($directory)) {
            mkdir($directory, 0755, true);
        }

        $zip = new ZipArchive();
        $result = $zip->open($zipFilePath, ZipArchive::CREATE | ZipArchive::OVERWRITE);

        if ($result !== TRUE) {
            abort(500, 'Failed to create zip file. Error code: ' . $result);
        }

        $fileCount = 0;

        // Add requirement files to zip
        foreach ($semester->requirements as $requirement) {
            // Create a folder for each requirement
            $requirementFolder = 'Requirements/' . $requirement->name;

            $requirement->media->each(function ($media) use ($zip, $requirement, &$fileCount, $requirementFolder) {
                // Use the direct path from Spatie Media Library
                $filePath = $media->getPath(); // Remove storage_path prefix!

                if (file_exists($filePath)) {
                    $archivePath = $requirementFolder . '/' . $media->file_name;
                    if ($zip->addFile($filePath, $archivePath)) {
                        $fileCount++;
                    }
                }
            });
---
select * from `requirements` where `requirements`.`semester_id` = 1 and `requirements`.`semester_id` is not null