app/Livewire/Admin/Dashboard/Overview.php

    public function mount($currentSemester)
    {
        $this->currentSemester = $currentSemester;
        $this->requirements = $this->currentSemester->requirements;

        $semesterDescription = $this->currentSemester
            ? $this->currentSemester->start_date->format('M d, Y') . ' - ' . $this->currentSemester->end_date->format('M d, Y')
            : 'No active semester';

        $this->stats = [
            [
                'title' => 'Current Semester',
                'count' => $this->currentSemester ? $this->currentSemester->name : 'None',
                'description' => $semesterDescription,
                'icon' => 'fa-calendar-days',
                'color' => 'primary',
            ],
        ];

        // Only show requirement-related stats if there's an active semester
        if ($this->currentSemester) {
            $this->totalRequirements = $this->requirements->count();

            $this->stats = array_merge($this->stats, [
                [
                    'title' => 'Total Requirements',
                    'count' => $this->totalRequirements,
                    'icon' => 'fa-list-check',
                    'color' => 'primary',
                ],
                [
                    'title' => 'Pending Requirements',
                    'count' => $this->requirements->where('status', 'pending')->count(),
                    'icon' => 'fa-clock',
                    'color' => 'warning',
                ],
                [
                    'title' => 'Completed',
                    'count' => $this->requirements->where('status', 'completed')->count(),
                    'icon' => 'fa-circle-check',
                    'color' => 'success',
                ],
                [
                    'title' => 'Due This Week',
                    'count' => $this->requirements->whereBetween('due', [now(), now()->addWeek()])->where('status', '!=', 'completed')->count(),
                    'icon' => 'fa-calendar-week',
                    'color' => 'accent',
                ],
            ]);
---
select count(*) as aggregate from `requirements` where `semester_id` = 2
select count(*) as aggregate from `requirements` where `semester_id` = 1 and `status` = 'pending' and `due` >= '2025-09-13 19:47:12'
select count(*) as aggregate from `requirements` where `semester_id` = 1 and `due` between '2025-09-13 19:47:12' and '2025-09-20 19:47:12' and `status` != 'completed'