app/Livewire/Admin/Dashboard/Overview.php

select * from `requirements` where `requirements`.`semester_id` = 2 and `requirements`.`semester_id` is not null
---
    public function mount()
    {
        $currentSemester = Semester::getActiveSemester();
        $semesterDescription = $currentSemester
            ? $currentSemester->start_date->format('M d, Y') . ' - ' . $currentSemester->end_date->format('M d, Y')
            : 'No active semester';

        // Base query that will be used for all requirement counts
        $requirementsQuery = Requirement::query();

        if ($currentSemester) {
            $requirementsQuery->where('semester_id', $currentSemester->id);