app/Livewire/Admin/Dashboard/Requirement.php

select * from `requirements` where `requirements`.`semester_id` = 2 and `requirements`.`semester_id` is not null order by `created_at` asc limit 20 offset 0
select count(*) as aggregate from `requirements` where `requirements`.`semester_id` = 2 and `requirements`.`semester_id` is not null
select * from `departments`
select * from `colleges`
select * from `requirements` where `semester_id` = 1 order by `created_at` asc limit 20 offset 0
---
    public function render()
    {
        $requirements = $this->currentSemester->requirements()
            ->search('name', $this->search)
            ->orderBy($this->sortField, $this->sortDirection)
            ->paginate(20);

        return view('livewire.admin.dashboard.requirement', [
            'requirements' => $requirements,
            'colleges' => College::all(),
            'departments' => Department::all(),
            'activeSemester' => $this->currentSemester, // Pass to view
        ]);