app/Livewire/Admin/Dashboard/SemesterAnalytics.php

select * from `semesters` where `semesters`.`id` = 1 limit 1
---
    public function loadStats()
    {
        $semester = Semester::find($this->selectedSemesterId);