app/Livewire/Admin/Dashboard/SemesterAnalytics.php

select * from `semesters` order by `end_date` desc
---
    public function mount($currentSemester)
    {
        $this->currentSemester = $currentSemester;
        $this->semesters = Semester::orderBy('end_date', 'desc')->get();

select * from `requirements` where `created_at` between '2025-09-12 00:00:00' and '2026-09-12 00:00:00'
select `users`.`id`, `users`.`firstname`, `users`.`lastname` from `users` inner join `submitted_requirements` on `users`.`id` = `submitted_requirements`.`user_id` inner join `requirements` on `submitted_requirements`.`requirement_id` = `requirements`.`id` where `submitted_requirements`.`submitted_at` between '2025-09-12 00:00:00' and '2026-09-12 00:00:00' group by `users`.`id`, `users`.`firstname`, `users`.`lastname`
---
    public function loadStats()
    {
        $semester = $this->currentSemester;

        if (!$semester) {
            $this->reset(['userActivityStats', 'storageStats', 'totalStorage']);
            return;
        }

        // Get all requirements in the semester period
        $requirements = Requirement::whereBetween('created_at', [
            $semester->start_date,
            $semester->end_date
        ])->get();

        $totalRequirements = $requirements->count();
        if ($totalRequirements == 0) {
            $this->userActivityStats = [];
            return;
        }

        // Get users who have submitted at least one requirement
        $activeSubmitters = User::query()
            ->select('users.id', 'users.firstname', 'users.lastname')
            ->join('submitted_requirements', 'users.id', '=', 'submitted_requirements.user_id')
            ->join('requirements', 'submitted_requirements.requirement_id', '=', 'requirements.id')
            ->whereBetween('submitted_requirements.submitted_at', [
                $semester->start_date,
                $semester->end_date
            ])
            ->groupBy('users.id', 'users.firstname', 'users.lastname')
            ->get();

select * from `submitted_requirements` where `user_id` = 1 and `requirement_id` = 1 and `submitted_at` between '2025-08-23 00:00:00' and '2026-08-23 00:00:00'
---
            $completionRate = 0;

            foreach ($requirements as $requirement) {
                $submissions = DB::table('submitted_requirements')
                    ->where('user_id', $user->id)
                    ->where('requirement_id', $requirement->id)
                    ->whereBetween('submitted_at', [
                        $semester->start_date,
                        $semester->end_date
                    ])
                    ->get();

select `mime_type`, sum(size) as total_size from `media` where `created_at` between '2025-09-12 00:00:00' and '2026-09-12 00:00:00' group by `mime_type`
---
            ->toArray();

        // Keep the existing storage stats logic
        $mediaStats = Media::query()
            ->whereBetween('created_at', [
                $semester->start_date,
                $semester->end_date
            ])
            ->select('mime_type', DB::raw('sum(size) as total_size'))
            ->groupBy('mime_type')
            ->get();