app/Livewire/Admin/Requirements/RequirementShow.php


        // Handle "select all" case - get all users with course assignments
        if (isset($assignedTo['selectAllPrograms']) && $assignedTo['selectAllPrograms']) {
            $userQuery->whereHas('courseAssignments', function ($query) {
                if ($this->requirement->semester_id) {
                    $query->where('semester_id', $this->requirement->semester_id);
                }
            });
---
select * from `requirements`