app/Livewire/Admin/Requirements/RequirementIndex.php

    public function render()
    {
        $colleges = College::all();
        $departments = Department::all();

        // Get the active semester
        $activeSemester = Semester::getActiveSemester();

        // Only query requirements if there's an active semester
        $requirements = collect();

        if ($activeSemester) {
            $requirements = Requirement::query()
                ->where('semester_id', $activeSemester->id)
                ->when($this->search, function ($query) {
                    $query->where('name', 'like', '%' . $this->search . '%');
                })
                ->when($this->sortStatus, function ($query) {
                    $query->where('status', $this->sortStatus);
                })
                ->when($this->sortAssignedTo, function ($query) {
                    $query->where('assigned_to', $this->sortAssignedTo);
                })
                ->when($this->completionFilter === 'pending', function ($query) {
                    $query->where('due', '>', Carbon::now());
                })
                ->when($this->completionFilter === 'completed', function ($query) {
                    $query->where('due', '<=', Carbon::now());
                })
                ->orderBy($this->sortBy, $this->sortDir)
                ->get()
                ->map(function ($requirement) {
                    // Calculate assigned users count without modifying the model
                    $count = 0;
                    $college = College::where('name', $requirement->assigned_to)->first();
                    if ($college) {
                        $count = User::where('college_id', $college->id)->count();
                    } elseif (Department::where('name', $requirement->assigned_to)->exists()) {
                        $department = Department::where('name', $requirement->assigned_to)->first();
                        $count = User::where('department_id', $department->id)->count();
                    }

                    // Add the count as a dynamic property
                    $requirement->assigned_users_count = $count;
                    return $requirement;
                });
---
select * from `colleges`
select * from `departments`
select exists(select * from `colleges` where `name` = 'College of Criminal Justice') as `exists`
select * from `requirements` where `requirements`.`semester_id` = 2 and `requirements`.`semester_id` is not null and `name` like '%quia%' order by `due` desc
select * from `users` where `users`.`id` in (2)
select * from `colleges` where `name` = 'College of Criminal Justice' limit 1
select count(*) as aggregate from `users` where `college_id` = 3
select exists(select * from `departments` where `name` = 'International Studies') as `exists`
select * from `departments` where `name` = 'International Studies' limit 1
select count(*) as aggregate from `users` where `department_id` = 25